In [11]:
import pandas as pd
import numpy as np

In [25]:
##Ejercicio 1
def ex1_concat_same_structure(data1, data2):
    d1=pd.DataFrame( data1)
    d2=pd.DataFrame( data2)
    return(pd.concat([d1, d2], ignore_index=True))
ex1_concat_same_structure(data1=({"Nombre":["Martin","James","Keonho"], "Edad":["17","20","16"]}),
                          data2=({"Nombre":["RM","JK","Hobi"], "Edad":["30","27","28"]}))

   Nombre Edad
0  Martin   17
1   James   20
2  Keonho   16
3      RM   30
4      JK   27
5    Hobi   28

In [38]:
#Ejercicio 2
def ex2_concat_with_month_column(mes):
    ventas=pd.DataFrame({"ventas":["20","30","25","40","35"]})
    mes=pd.DataFrame(mes)
    return(ventas.join(mes))
ex2_concat_with_month_column({"meses":["Enero","Febrero","Marzo","Abril","Mayo"]})

  ventas    meses
0     20    Enero
1     30  Febrero
2     25    Marzo
3     40    Abril
4     35     Mayo

In [43]:
#Ejercicio3
def ex3_concat_diff_columns_fillna():
    sujetos=["s"+str(i).zfill(2) for i in enteros]
    pd.DataFrame({"sujeros":[sujetos]})"""Ejercicio 3:
    Crea dos DataFrame que no tengan exactamente las mismas columnas (ej.: uno tiene
    'Producto' y 'Ventas', el otro 'Producto' y 'Descuento'). Concat√©nalos y asegura
    que los valores faltantes queden rellenados con 0. Retorna el DataFrame resultante.
    """

SyntaxError: invalid syntax (2904224087.py, line 4)